# Criando os nomes

In [1]:
import pandas as pd

In [4]:
nomes_f = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-f.json')
nomes_m = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-m.json')

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [5]:
nomes_f.sample(5)

           nome  regiao    freq  rank sexo
111     TAMIRES       0  142898   112    F
18      VANESSA       0  417512    19    F
51        JOANA       0  268576    52    F
178  ELIZANGELA       0   88505   179    F
124        LAIS       0  130730   125    F

In [6]:
nomes_m.sample(5)

        nome  regiao    freq  rank sexo
165   ISAIAS       0   78418   166    M
120  EDILSON       0  123872   121    M
12    RAFAEL       0  814709    13    M
28   LEANDRO       0  506483    29    M
68      CAIO       0  225902    69    M

In [8]:
print('Quantidade de nomes: ' + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [9]:
frames = [nomes_f, nomes_m]

In [13]:
nomes = pd.concat(frames)['nome'].to_frame()

In [14]:
nomes

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
195     WALTER
196    ARLINDO
197    MICHAEL
198     ALVARO
199    GEOVANE

[400 rows x 1 columns]

In [15]:
nomes.sample(5)

         nome
8    PATRICIA
93     ELIANA
131     BRENO
161    DAMIAO
68      LUIZA

# Incluindo ID dos alunos

In [18]:
import numpy as np
np.random.seed(123)

In [19]:
total_alunos = len(nomes)
total_alunos

400

In [22]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [25]:
nomes.sample(5)

        nome  id_aluno
92     DIOGO       345
166    KELLY        45
98     THAIS        12
142     HUGO        19
184  MARILIA       252

In [27]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [28]:
nomes.sample(5)

        nome  id_aluno                 dominio
63    MIGUEL        81  @dominiodoemail.com.br
185   SHEILA        38  @dominiodoemail.com.br
144   LORENA       311     @servicodoemail.com
120  EDILSON       398     @servicodoemail.com
101   GISELE       282     @servicodoemail.com

In [29]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [30]:
nomes.sample(5)

         nome  id_aluno                 dominio                         email
75     NELSON        48  @dominiodoemail.com.br  nelson@dominiodoemail.com.br
18   RAIMUNDO       267     @servicodoemail.com   raimundo@servicodoemail.com
120   JOSIANE       179     @servicodoemail.com    josiane@servicodoemail.com
74       ALAN       123  @dominiodoemail.com.br    alan@dominiodoemail.com.br
71      MARTA       326  @dominiodoemail.com.br   marta@dominiodoemail.com.br